[{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jul 27, 2023","REVIEWER_NAME":"Mo87","TITLE":"Nice and handy Vacuum","CONTENT":"[This review was collected as part of a promotion.] I bought this vacuum 2 weeks ago. In summary:\r\n1. Easy to set up, took 30 mins\r\n2. Very light, so if you are old and worried about holding it, it is easy to use \r\n3. Has good joints, which makes good to difficult areas to reach\r\n4. Has strong suction\r\n5 comes with many tools that you can use\r\n6. Has auto emptying feature, which is really nice \r\n7. My wife likes it and my wife tends not to like things I buy much !"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"","REVIEWER_NAME":"RICHARD","TITLE":null,"CONTENT":null},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":2,"POST_DATE":"","REVIEWER_NAME":"KIKO","TITLE":null,"CONTENT":null},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":1,"POST_DATE":"","REVIEWER_NAME":"DAVID","TITLE":null,"CONTENT":"I’m very disappointed and sorry I wasted my money!  A pile of plastic junk!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jul 17, 2023","REVIEWER_NAME":"Liz68","TITLE":"On of the best an the market ...","CONTENT":"[This review was collected as part of a promotion.] I intended to buy this LG CORDZERO ,because I have health issues. This is the best product for me .Thanks LG"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":3,"POST_DATE":"","REVIEWER_NAME":"Nadine Arrotta","TITLE":null,"CONTENT":"always gets clogged. everytime i use it, i have to pull it apart"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jul 13, 2023","REVIEWER_NAME":"HeatherRN","TITLE":"Love this Vac!","CONTENT":"[This review was collected as part of a promotion.] I recently recieved this vacuum in the mail. It is perfect. It is lightweight and easy to use. It does not take up a lot of space and the attachments are easy stored inside the tower. Battery lasts about 30 minutes when running nonstop. There is also an extra battery if you need to vacuum longer. I love that I can take this vacuum anywhere without having to worry about tripping on a cord. The only problem I have found is that it does clog pretty easily but it is easy to unclog. The vacuum slides apart with a push of a button and you can remove the clogs. The suction power is really good and it also has different speeds of suction depending on what your cleaning. I highly recommend this vacuum especially for someone who isn’t able to lift much weight. I use it in my car, Rv and home with no problems. It also empties itself inside a bag that is stored in the tower so your not always having to empty it after each use."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jul 7, 2023","REVIEWER_NAME":"Cooll101","TITLE":"Awesome cordless vacuum","CONTENT":"I had it for two weeks and it is the best . Works well on all my wood and tile floors"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jun 26, 2023","REVIEWER_NAME":"Cheryl Lynn R","TITLE":"Love it!!!!","CONTENT":"Having a cordless vacuum is one of the best things to come along. I have a very big house and I am able to vacuum the entire house without the battery dying on me. Also having the automatic empty is an extra bonus!!! Love it!!!!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":3,"POST_DATE":"Jun 25, 2023","REVIEWER_NAME":"Jamieberg1451","TITLE":"It’s a good vacuum","CONTENT":"[This review was collected as part of a promotion.] I wanted to love this. I’d been so excited for it to arrive, and patiently waited for my husband to put it together. (Took him about 20 minutes.)  \r\n\r\nThe good:\r\n- it’s quiet. SO quiet, that I thought it wasn’t working, u til I noticed the internal dust cup filling up. \r\n- it’s lightweight. I have owned 2 other cordless vacuums and this one is the lightest by far. \r\n- since it vacuums itself, I have yet to have a clog - something that I was having frequently with other brands. \r\n- all of its accessories are stored right in the unit, making them easy to store and find when I need them. Again, other vacuum parts have been difficult to manage. \r\n- comes with 2 batteries. My house is small, so I’ve never run out of battery while using it. But having a spare on hand is very nice. \r\n\r\nRoom for improvement:\r\n- the dust cup is tiny. It fills up way faster than the battery runs out. \r\n- while it’s nice the height is adjustable, it only fits on the base at the smallest size. So it’s a bit tedious taking it on and off the base. \r\n- the internal dust storage bin is very small, and I really wish the bags were reusable. Seems very wasteful. \r\n- while it’s fancy that the vacuum cleans itself, it takes a silly amount of time to return to the base, lower the height, hook it on the base, and wait for it to empty. It’s much easier to walk to the nearest trash can, empty it, and continue cleaning. \r\n\r\nThis is a good vacuum. It works well. I can feel the intensity change as I move from carpet to hardwood and back again. I just don’t love it, some of the features seem a bit unnecessary. If you really want to have the fanciest vacuum available, this one absolutely suits you. If not, you may find it better to find something a bit less fancy."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":3,"POST_DATE":"Jun 25, 2023","REVIEWER_NAME":"Fayt413","TITLE":"It works great, when its not plugged up","CONTENT":"[This review was collected as part of a promotion.] It's easy to charge and add attachments. I don't like how the small holding compartment is small because it has to be emptied alot. It also gets plugged up really easily and I have to use a screwdriver to clear it, and that's before it even gets to the holding compartment.\r\n\r\nLikes\r\nDoes good with pet hair\r\nSuction is really good for being cordless\r\nDoes have a filter but haven't needed to clean it yet\r\n\r\nDislikes \r\nFaster to empty manually then with base\r\nThe base doesn't clean the compartment as well as manually emptying \r\nFills really quickly\r\nPlugs easily"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jun 14, 2023","REVIEWER_NAME":"djallen27","TITLE":"Great system and works really well","CONTENT":"[This review was collected as part of a promotion.] We have had a dyson vacuum for about 4-5 years and never thought we would switch.  But, I am so glad we did.  This Cord Zero works so well and even better than I could have imagined.  It also holds a charge really long too!  We can vacuum the whole house without having to plug back in.  We love it!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jun 11, 2023","REVIEWER_NAME":"ElliottP","TITLE":"Worth the Money!","CONTENT":"We take lots of time to think about all of our purchases, and usually do tend toward purchasing more expensive options of things due to wanting good quality instead of the throw away garbage our society has steered so heavily towards, though even highly priced items can sometimes be hunks of junk.\r\n\r\nThat was luckily not the case for this vacuum! While unpacking the vacuum it quickly became clear that this was really quality, there are even some metal parts instead of plastic which was so refreshing to see!\r\n\r\nThe vacuum works very well, it’s easy and fun to use, has some great attachments that come with it, and is so nice to just turn the power on instead of having to hold down a trigger constantly to use like so many stick vacuums have.\r\n\r\nThe tower is equally great with storing the attachments, mounting the vacuum, and I love that it empties the vacuum whenever I hook it back up!\r\n\r\nOverall great design, great functionality and versatility, and well built with good materials. Vacuuming is now fun to do, whether going over the whole house, or just for a quick cleanup of a particular mess!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jun 11, 2023","REVIEWER_NAME":"Empirepjp","TITLE":"The coolest","CONTENT":"Quiet, great suction. The best dirt dispenser and station setup. At this point, it is better than my past vacuums including Dyson. So far worth the investment."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":3,"POST_DATE":"","REVIEWER_NAME":"NYDAD","TITLE":null,"CONTENT":"Underwhelming - sent back for repair for significantly  underwhelming suction power. Will see how it goes."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jun 7, 2023","REVIEWER_NAME":"jereome","TITLE":"The best vacuum I have ever owned.","CONTENT":"[This review was collected as part of a promotion.] While this is pretty pricey I have to say that it is well worth it. Overall this is the best cordless vacuum that I have ever owned and here are the reasons why.\r\n\r\n1. The vacuum is much lighter compared to other cordless vacuums that I have owned. My previous vacuum seemed like a workout when I vacuumed the whole house. Whereas this one is a breeze.\r\n2. Battery life. This vacuum does a great job keeping my 2200 square foot home clean and hasn't run out of power yet and if it does I am not worried because there is a spare always charging in the vacuum base.\r\n3. The suction. Boy does this vacuum suck but in a good way. On the highest setting it is pulling up the dirt stuck UNDER my carpet which I have never had a vacuum do.\r\n4. The base. I like that this vacuum has a base where you plug it into. Not only does it make the kids put it up instead of leaving it wherever like they did with the old vacuum but it also provides a convenient storage location for all of the vacuum accessories.\r\n\r\nAnd now for the one thing that I do not like about this vacuum.\r\n1. It doesn't have a light. This is kind of disappointing but overall this is still the best vacuum I have ever owned."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":1,"POST_DATE":"Jun 6, 2023","REVIEWER_NAME":"Mokarimakka","TITLE":"Had to Return It","CONTENT":"I opened the box, got out all the tools, then pulled out the main base, and the bottom black portion of the stand was cracked in two places.  I had to send it back, but will try another one."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jun 5, 2023","REVIEWER_NAME":"Oscar CA","TITLE":"So far beyond my expectations!","CONTENT":"[This review was collected as part of a promotion.] Wow! LG really hit it out the park with this vacuum! It does is all! Vacuums, mops, empties debris on it own! Set up was relatively easy, maybe 15-20 minutes, and it is only because everything comes so well packed. The mop features 2 dual spinning microfiber pads, which do all the hard work for you. My other mop is officially retired! I have never seen my kitchen floors so clean! The vacuum has a 5 step HEPA filtration system,  so you know you are getting a clean carpet with less allergens left behind. It comes with 2 batteries, it is recommended to switch them out after every use to extend the life of the batteries. Which makes sense and is very fast and simple to do. They say it goes about 2hr before needing a charge or needing to switch batteries.  But honestly, it only takes 20- 30 minutes to completely clean my floors. The housing tower is great! It's stylish but low-key so it does not stand out. It houses just about everything, it is great having everything in one spot! It empties the broom stick in seconds and is relatively a quite process. Over all it went way beyond my expectations! It has changed the way I cleaned and has made the actual cleaning process easier, taking a lot less time."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jun 2, 2023","REVIEWER_NAME":"Candicefree","TITLE":"Love that the machine empties the dust and dirt!","CONTENT":"[This review was collected as part of a promotion.] I am in love with my new LG vacuum! It is one of the lightest ones I have ever owned. The head of the vacuum is a little smaller than my other cordless but works great. The suction is amazing on this little machine. The vacuum comes with a docking station that holds an extra battery that charges, all the accessories fit inside the station and the vacuum charges while docked. After you are finished and hang the vacuum up the special feature will suck the debris from the tank and dispose of it in a bag below. Seriously so totally like “the Jetson” like. Best vacuum EVER!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 31, 2023","REVIEWER_NAME":"Aliciadh","TITLE":"Wow","CONTENT":"[This review was collected as part of a promotion.] Absolutely amazing! I absolutely love this! LG vacuum. It's incredible. I thought my carpets and floor were clean before but wow using this really picked up the dirt. The suction is great. It's lightweight and the charging station is just awesome. This product needs 10 stars!!!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 31, 2023","REVIEWER_NAME":"BoyMom03","TITLE":"Game Changer!","CONTENT":"[This review was collected as part of a promotion.] This is by far the best vacuum I've ever used. Setup took all of 5-10mins and is an easy one person job. It's so easy to place and take out of charging station. I absolutely love how easy it is to empty out the waste bin. My carpet looks much brighter and I DON'T HAVE TO SWEEP OVER THE SAME AREA more than ONCE!!!! You can change from regular suction to turbo if you need a little bit more power which is a major plus. I've also used on my kitchen flooring which also does an amazing job. I cleaned by steps which can really take a lot of energy, but not with this vacuum. It's very light and functional that it did each step with only one hand and didn't have to fumble around with the cord. Upon setup, I charged for about an hour before my first use and was beyond amazed with the results. If you like a thorough cleaning that doesn't require manual labor.... I HIGHLY RECOMMEND! Satisfied Customer"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 31, 2023","REVIEWER_NAME":"Elara1114","TITLE":"Great vacuum!!","CONTENT":"[This review was collected as part of a promotion.] I got this a week ago and it’s wonderful. I don’t know why I waited so long to try a LG vacuum. It’s quiet and light. The best part is that it self empties. No more emptying the collection container over a dirty trash can. My hands can stay clean while this empties on its own in a minute.  The tower came pre assembled. The only thing you can to put together is the vaccum and it was super easy to figure out. It also comes with extra nozzle in the box. I am so happy with this vaccum. Will be recommending it to everyone!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 30, 2023","REVIEWER_NAME":"Hollys142","TITLE":"A POWERHOUSE VACUUM SYSTEM","CONTENT":"[This review was collected as part of a promotion.] I can honestly say that I feel like I am not giving this product enough credit by calling it a vacuum,as it truly is that good. This cordless vacuum has so many amazing features and more suction power than any corded vacuum that I have ever used.The features are endless such as auto empty ,Kompressor technology that compresses the dirt in bin,washable filters,a 5 step filtration system plus many more. This cordless vacuum docks in a sleek,modern docking station that matches any decor and also holds up to 6 tools and 2 rechargeable batteries which gives you a whopping 2 hours of run time.\r\nI love that this vacuum can be used on different flooring surfaces, as I have hardwood and tile in my home and this literally sucks up everything leaving absolutely nothing behind. Not only is this the best vacuum that I have ever used,it also has an incredible 10 year warranty and has built in WI-FI so that you can connect to the LG APP to keep a cleaning schedule,run diagnostics,etc. Overall, this vacuum may be a bit pricey but is honestly worth every dollar and I would highly recommend it to everyone, including my family and friends."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 30, 2023","REVIEWER_NAME":"jemino1744","TITLE":"Cord Zero Vaccum","CONTENT":"[This review was collected as part of a promotion.] I bought this item 1month ago, it was amazing wireless vacuum, perfect design, great"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 30, 2023","REVIEWER_NAME":"MH513","TITLE":"Awesome vacuum!","CONTENT":"[This review was collected as part of a promotion.] Great vacuum easy to setup and get started does come with 2 manuals for help. So easy a toddler can use it. Compare to my old vacuum this one it’s amazing. Glides on my hardwood floor with ease and my favorite I can clean my stairs and get under my bed. Very please! Definitely recommend! \r\n\r\nPros:\r\nCordless\r\nBackup battery\r\nExtra attachments\r\nExtra waste bags\r\nGreat design \r\nStrong suction when on turbo only \r\nCharges fast\r\nEasy to clean \r\nDoesn’t take up much space \r\nRemovable parts in case something gets stuck\r\nEasy to use on stairs\r\n\r\nCons:\r\nBags don’t be full before it needs a new one\r\nTurbo doesn’t last long"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"May 29, 2023","REVIEWER_NAME":"Dave Thom","TITLE":"Very nice cordless vacuum","CONTENT":"[This review was collected as part of a promotion.] This is a really nice cordless vacuum model. It is really sleek looking and my wife doesn’t mind having it on display, unlike our other vacuum that has been relegated to the closet. It was easy to put together and set up. It actually had quite a bit of power when you use the turbo button. I like that it has additional attachments. It works great on our carpet and on our tile. The only downside I’ve noticed is that having pets seems to make it clog from the fur sometimes. And another thing that I’m not really happy about is the bags. While it did come with three of them, they are very small. And they are also not reusable, I can’t empty them and then reuse them. I have a large family with animals, this just isn’t economical for us to have to buy new bags that hold so little debris. I’ve had it for a short time, and I’m already on my last bag that was included. I do appreciate the design and overall functionality of this device though. I love that it self empties and has such a long charge life. I just can’t see having to keep purchasing the bags constantly."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 29, 2023","REVIEWER_NAME":"Mels44","TITLE":"Stylish Hassle-Free Cleaning","CONTENT":"[This review was collected as part of a promotion.] The tower is definitely an interesting conversation piece. It currently sits in my dining room, where it has plenty of space to stand out. I must say, the tower is quite sturdy and complements any decor beautifully. It not only serves as a storage area for the spare battery but also provides a special spot for all the additional attachments. Once you're done vacuuming, simply press the button on the tower, and it will effortlessly empty the debris from the vacuum, conveniently storing the vacuum itself.\r\n\r\nNow, let's talk about the vacuum itself. It's a typical stick vacuum, but what's impressive is how quiet it is. It's by far the quietest vacuum I've ever used, and its lightweight design makes it ideal for quick and easy clean-ups. It's especially efficient at picking up dust, small crumbs, and pet hair. The lightweight feature also makes it a breeze to clean furniture and tackle stairs in the house. In terms of suction power, it performs admirably in regular mode. If you need some extra oomph, there's a turbo mode available that provides a significant boost in suction power, although it does come with increased noise and power consumption. The turbo mode drains a fully charged battery in about 10 minutes, so it's better suited for shorter cleaning sessions. Thankfully, the battery lasts much longer when using the regular mode. As a mother of young kids, I must admit that I was slightly disappointed with its ability to handle larger crumbs with ease. Additionally, I found it a bit challenging to push on my rugs compared to hard surface floors.\r\n\r\nAll in all, it's a great lightweight stick vacuum that works wonders for quick cleaning on hard surface floors and furniture. The tower is a practical addition, ensuring that the vacuum is always conveniently ready for use. Plus, having an extra battery is a real lifesaver, providing ample power to meet all your vacuuming needs. Personally, I particularly appreciate the tower's self-emptying function, the option to switch batteries, and the storage space for all the additional accessories."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 26, 2023","REVIEWER_NAME":"dengreat","TITLE":"Looks Great, Easy to Use, Luxurious","CONTENT":"[This review was collected as part of a promotion.] This is the height of luxury for stick vacuum cleaners!\r\nWhat I like\r\n- Starts charging when you hang it up\r\n- Has backup battery charged and ready to go at all times\r\n- The telescoping extension for the upright head\r\n- built-in storage for accessories\r\n- auto-empties dust bin when you hang it up!\r\n- extremely easy to use\r\n- press a button to turn it on and off instead of holding a trigger\r\n- very stable base instead of cheap wall-mounted plastic\r\n- looks very pleasing to the eye. No need to hide it in a closet.\r\n\r\nThere is only one feature that my old stick vacuum had that this one doesn't that would be nice to have and that is a light on the vacuum so it shines along the floor as I'm vacuuming. Having that light does a great job of highlighting where little random bits have gotten off to. Other than that this vacuum has me sold. It might be a little pricey, but it is built to last."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 24, 2023","REVIEWER_NAME":"Samantha83","TITLE":"Wow!","CONTENT":"[This review was collected as part of a promotion.] Honestly, I don’t know where to even start on why I love this vacuum because it really is amazing! I am quite the vacuum snob so I am not easily impressed lol. I have hardwood, tile floors, carpet and shag area rugs in my house and this vacuum works beautifully on all of them. Some of the things that stand out the most to me are how it effectively cleans and fluffs the shag area rugs without getting bogged down like my other stick vac. I think the diameter of the agitator helps since it is so large and the shag cannot wrap around it at all. The suction on the bare tile and hardwood it fantastic and I am super impressed but the suction and cleaning ability against baseboards. The docking station and self cleaning feature is fantastic. I love that you store all of the attachments in the base and that you have a backup battery ready to go! The battery life is much better than my other stick vacs I’ve had. I was able to do multiple rooms in a single charge. Also, this vac is very quiet compared to my others. A++ for this stick vac!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 23, 2023","REVIEWER_NAME":"Lunchbox09","TITLE":"Outstanding stick vacuum!","CONTENT":"[This review was collected as part of a promotion.] We have more than a few vacuums in our home, multiple stick vac’s from the other brands, as well as canisters, and shop-vacs. This one takes the cake as my new favorite. First impression is that it LOOKS great, I hardly want to move it to a closet or the laundry room because it is so sleek looking. The tower holds all accessories, which is awesome because if they don’t have a place they usually get lost in my house, only to be found 3 years later. Also, the auto empty feature of the tower is just awesome. The other stick vacs that I have used were always a pain to empty, and I would wind up getting dirt and dust all over the garbage can, or the floor that I just cleaned. Now everything is contained. Right from the vacuum to a large bag in the tower! This LG vacuum is also a breeze to use, it feels balanced in my hand. The telescoping tube is a great feature, and allows me to clean without bending over (I’m 6 foot tall). As for power, there is no shortage. Just on the normal mode it does a great job, but when you turn on turbo there is a noticeable difference in power. This difference in power makes it slightly louder, but still not as loud as other vacuums we own. The kompressor feature is also a great addition. As you’re vacuuming you can push all the dust and pet hair collected down, leaving more room before emptying. Which is externally helpful if you live in a house that doubles as a zoo like us (2 dogs, a cat, a snake, a lizard, and of course three kids under 13). The tower also holds an additional battery, which stays charged for longer cleaning. All you have to do is open the top, and swap out the awaiting battery, and off you go! Great idea! The app is a nice feature to have, it logs the cleaning time and amount used. It also can notify you on when filters need to be cleaned and changed. The app also tells you the battery life remaining, and when the unit has finished charging. All in all I love this new vacuum, and would recommend it to anyone with a larger home looking for a stick vac!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 23, 2023","REVIEWER_NAME":"bluewife","TITLE":"Exceeded expectations","CONTENT":"[This review was collected as part of a promotion.] I got this stick vacuum in hopes of doing a better job keeping my carpeted stairs clean.  I was also excited that it might get used on the carpets in my vehicle.  What I was NOT expecting was:\r\n- A truly long battery life\r\n- A lightweight vacuum that I could easily carry all around my home\r\n- An enjoyable vacuuming experience\r\nOur home is 2500 square feet.  I used this first on my carpeted stairs, next I tackled the first floor, then I redid the stairs (with an attachment this time), and then last I did the entire second floor.  I depleted the first battery after about 35 minutes of use (much of that use was on Power Mode) and then I only used the second battery for a couple of minutes (showed 99% full battery when I finished) I used the Normal mode on my hard floors and the Power mode on my carpeted areas.\r\n\r\nI found it to be very easy and intuitive to set up and use the base station. I love that the included attachments are neatly stored (cannot say the same for my corded vacuum's attachments which can rarely even be found let alone used)  It's a real treat to have this in my home and I actually enjoy using it.  It's not giving me shoulder pain or a weird callus on my hand from using it for so long (I'm not the only one right?).... it's just light, easy, and powerful.  You'll feel like you're supposed to be hunched over and holding a cord out of the way.  It will take some getting used to, to not instinctively hunch over, and just be able to walk around comfortably, like you're not doing a labor-intensive chore."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"","REVIEWER_NAME":"tmle","TITLE":null,"CONTENT":"[This review was collected as part of a promotion.] Very nice station comes with accessories that fit everything into the base. Love the self-emptying feature. Very convenient. Not like my other vacuum, I must open it and release it and blowing it back on me.  Also come with an extra battery (extra A+) , extra dust bags, and accessories. Instead sweeping, now my wife just picks this bad boy up and start turbo vacuuming.  Suction is powerful and quieter than my other vacuum. Pick up all my children dirt, food, and  anything that can be vacuum on the floor. It does the jobs better than my other vacuums. Worth it and will recommend this LG vacuum over others."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"","REVIEWER_NAME":"RaeMo","TITLE":null,"CONTENT":"[This review was collected as part of a promotion.] I just want to start of by saying that up until now, my household has been strictly a Dyson house. We bought  Dyson Ball for 25.00 about 9 years ago and it's just recently died, and we replaced it with another Dyson, and then got the Dyson stick vacuum. I was reluctant to try out the LG, but the cordless Dyson dies too quickly for my comfort and I'd heard great things about the LG, so decided to take the chance. I'm so glad I did! So, I recently received the CordZeroTM All in One Cordless Stick Vacuum with Auto Empty, and it has absolutely transformed my cleaning routine. This vacuum outperforms all of my expectations in terms of performance and design.\r\n\r\nFirst and foremost, let me express how amazed I am with how wonderfully this vacuum cleans. It effortlessly picks up dirt, dust, and debris, leaving my floors spotless and my carpets looking new. It's extremely effective and can even trap small particles, ensuring a thorough cleaning every time. It also offers several cleaning modes, allowing me to vary the suction intensity based on what I'm cleaning.\r\nThe automatic emptying feature of the CordZeroTM is one of its distinguishing features. It's simply incredible! No more filthy trash cans for me. This vacuum empties the dirt into a base station on its own, making it extremely easy and sanitary. I don't have to worry about touching the dust or making a mess. It's a clever touch that distinguishes this vacuum from the competition.\r\n\r\nAnother advantage of the CordZeroTM is its ease of portability. It's lightweight, cordless, and glides from room to room with ease. I can easily reach difficult areas and maneuver around objects. When I need to clean above the floor, it converts into a handheld device, making it quite adaptable.\r\n\r\nThe CordZeroTM's battery life is also outstanding. It lasts a long time, allowing me to clean my entire house without interruption. And if I ever need more power, all I have to do is switch to a fully charged backup battery. There's no need to be concerned about running out of power when cleaning.\r\n\r\nI really like the CordZeroTM's clean design. It has a trendy appearance and complements my house design beautifully. The controls are simple to use, and the LED lights on the floorhead ensure that I can see even in low-light situations."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 22, 2023","REVIEWER_NAME":"Nessa82582","TITLE":"Amazing","CONTENT":"[This review was collected as part of a promotion.] I love the LG cordless vacuum cleaner!  Assembly was super easy, each part came with easy to follow instructions.  It took my son and I about 10 mins to assemble completely.  I love how light weight the vacuum cleaner is!  I struggle with back problems and I had no problem adjusting the handle to fit my height.  I also love how the vacuum base swivels and fits under small spaces.  I was able to vacuum under my kitchen table and chairs without moving it.  Also, the vacuum did an amazing job reaching all the way under my bed (I have a bed that sits high off the floor).  Overall, this is the best vacuum I’ve owned!  The only downfall is price, I feel like it’s slightly over priced.  For the price of the vacuum I feel as if it should vacuum on its own…not me still pushing it.  It’s a plus that it does self empty but I still have to push it…lol."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 22, 2023","REVIEWER_NAME":"Lindsey920","TITLE":"Amazing!","CONTENT":"[This review was collected as part of a promotion.] I cannot say enough about this vacuum! I've only had it for about a week and I am thrilled with it already! I need to vacuum and sweep every day because of my dogs. Love them but hate their hair everywhere. This cuts my time in half, holds its charge, EMPTYS ITSSELF, and has all the attachments I need to get every inch of my floor and door frames. This even gets all the way under my couches and furniture! It's something that I needed and didn't even know! Sleek design and fits nicely in my closet out of the way! 100 out of 10!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 20, 2023","REVIEWER_NAME":"LazyLlamasMomma","TITLE":"LGs got game!","CONTENT":"[This review was collected as part of a promotion.] When I think about vacuums LG isn’t a brand that comes to mind, but this cordless vac has changed the game! It’s so light weight, super quiet and I can get my whole downstairs vacuumed before the battery dies. It does come with a back up battery too, which is nice I can change it out and vac the upstairs without having to wait for the battery to charge before I can finish my task. Quick and easy set up, I like how it will self empty so I don’t have to mess with that mess each time I vacuum."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 20, 2023","REVIEWER_NAME":"joelh","TITLE":"This vacuum sucks ..in a good way !!","CONTENT":"First vacuum that I have ever owned that makes me actually WANT to do housework !  The coolest part, is to put it back in it's stand and have the dirt sucked out of it automatically, no muss no fuss.  What great engineering !"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"","REVIEWER_NAME":"HomeDepotCustomer","TITLE":null,"CONTENT":null},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 3, 2023","REVIEWER_NAME":"Jonathan2023","TITLE":"An amazing invention!","CONTENT":"Brought this vacuum 2 months ago and I have no words to describe how happy I am with it. Definitely the best investment I made, 2 in one (vacuum & Mopping system). Worth’s the price!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Apr 18, 2023","REVIEWER_NAME":"Gamondi","TITLE":"Good Vacuum","CONTENT":"[This review was collected as part of a promotion.] Very light, and my wife has no problem using it to clean the stairs."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Apr 12, 2023","REVIEWER_NAME":"John L Strack","TITLE":"CordZero Vacuum - Repairs","CONTENT":"[This review was collected as part of a promotion.] We are very pleased with the product and were disappointed when we couldn't remove the vacuum from the charging tower. I have all the confidence in LG that it has been repaired or replaced."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":1,"POST_DATE":"Apr 9, 2023","REVIEWER_NAME":"Brittier","TITLE":"Horrible","CONTENT":"We spent over $900 for this vacuum as were wanting the self emptying feature. This vacuum has been nothing but a nightmare. There is not a light which even the cheapest vacuums have, it is horrible with picking up small items on the floor such as dog food, suction is poor, the vacuum is constantly getting stuck on the dust canister and now twice the lid as snapped off. We have had to get new lids sent to us as impossible to try and do yourself. Seriously our $50 backup vacuum is so much better."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Apr 7, 2023","REVIEWER_NAME":"DanoFLA","TITLE":"Beautiful Design but lacks LED lighting feature","CONTENT":"Purchased this beautifully designed cordless vacuum but it lacks suction power for the high cost compared to my corded unit.  Also at this price it should have high powered LED lighting on floor unit to allow easy detection of dust on the floor."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Apr 1, 2023","REVIEWER_NAME":"AA23250706","TITLE":"It really sucks","CONTENT":"[This review was collected as part of a promotion.] We’ve had this vacuum a few weeks and are completely satisfied. It has strong suction and the back up battery helps us get our full house completed. Knowing that we have a limited time helps us clean faster too. I was worried that there would be an issue with it picking up cereal because of previous reviews, but it looks like that has been updated. We are always vacuuming up Cheerios with no problem. The sleek design and cool feature have interested our oldest in helping out around the house vacuuming every chance they get. I also love the self emptying feature. I took a star off because it can only be stored on a hard surface which is limiting. Otherwise this was a great investment. I would for sure recommend."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Mar 31, 2023","REVIEWER_NAME":"Prnelson01","TITLE":"Convenient,  ergonomic, and does the job!","CONTENT":"I have severe back issues and had all but given up trying to vacuum, so I thought I would give the LG CordZero a try to avoid having to hire someone every time I needed to vacuum.  I am so happy with it!  It is lightweight,  does not pain me to use, and does the job.  In particular, it is great on wood floors, gets along edges, in corners, and under furniture better than most vacuums.  Both the Power Mop and the Universal Nozzle work great.   I can highly recommend the CordZero for anyone who is getting up there in age and needs a vacuum that is \"user-friendly\" and \"pain free\"."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Mar 28, 2023","REVIEWER_NAME":"Yura Taran","TITLE":"Very good","CONTENT":"[This review was collected as part of a promotion.] picks up dirt and debris very well.  Works great on both carpet and hard floors."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Mar 28, 2023","REVIEWER_NAME":"Constance85","TITLE":"Amazing","CONTENT":"[This review was collected as part of a promotion.] I bought this vacuum didn’t expect it to be so amazing!! Wish I would’ve bought this sooner!!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Mar 27, 2023","REVIEWER_NAME":"Mac Rost","TITLE":"Amazing stick vacuum!","CONTENT":"[This review was collected as part of a promotion.] I've used this more than any other appliance honestly. It works great on my irregular tile, hardwood and carpeting. Even works on entrance\/exit mats! Literally hands free emptying of the catcher is awesome. I've already had to empty the tower bag, but that was so easy as well. The entire design of this product is 100%."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Mar 27, 2023","REVIEWER_NAME":"Berniemax","TITLE":"expensive and not quite worth it","CONTENT":"I have to run this vacuum on med power to pick anything up off the floor, otherwise it just flings objects on the floor. This reduces the battery life considerably.\r\nThere are no lights on the head for you to see what you are cleaning.\r\nIt is very difficult to push on rugs, so I presume it's only for bare floors.\r\nThe floor cleaner is ok, but you can't really push down on it to scrub hard.\r\nBut the automatic cleaning of the vacuum is nice, as well as the charging station"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Mar 20, 2023","REVIEWER_NAME":"bcorwyn","TITLE":"Love the Features and Tower","CONTENT":"[This review was collected as part of a promotion.] I recently switched from Dyson and am so happy I did! The features are great and I love how the tower hold the attachment as well as empties the bin for you. So far, I am very happy I switched."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Mar 13, 2023","REVIEWER_NAME":"dutchynaw","TITLE":"Solid Performer","CONTENT":"I bought this vacuum for the self emptying feature.  I hated banging out dusty dirt cups in the trash can.  This fills a convenient bag for easy clean up.  The only con I have found so far is the performance on hard floors.  I wish there was a parquet twister or some similar item for hard floors."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"","REVIEWER_NAME":"loveourdogs","TITLE":null,"CONTENT":"[This review was collected as part of a promotion.] Awesome vacuum!! The self emptying bin is the best thing ever invented for these stick vacs."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Mar 12, 2023","REVIEWER_NAME":"Deeznutzbemine","TITLE":"Great machine!","CONTENT":"[This review was collected as part of a promotion.] We love this thing! Works wonderfully and sucks up dirt like it ain’t no thang."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Feb 26, 2023","REVIEWER_NAME":"tksjax","TITLE":"Great vacuum","CONTENT":"I had not planned on buying this vacuum that day but am so glad I did.  So easy to set up\/use and my dogs aren’t terrified of the noise."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jan 28, 2023","REVIEWER_NAME":"PapaLip","TITLE":"Cool cordless vac","CONTENT":"[This review was collected as part of a promotion.] This vacuum is so cool. Clean up is a breeze and the thing is awesome"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jan 12, 2023","REVIEWER_NAME":"AmDi","TITLE":"Love it!!!","CONTENT":"[This review was collected as part of a promotion.] I bought this about a month ago and used the vacuum and mopping and love them both. I like the tower and help me to keep the vacuum clean without getting dirty. Overall, I recommend this vacuum."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jan 11, 2023","REVIEWER_NAME":"LG cordzero A9","TITLE":"Good vacuum and mop","CONTENT":"I needed to replace my old stick vac after not being satisfied with its pickup and performance. I went to Abt store  and tested all the vacuums on display. The one that stood out was the LG A9. After buying one and using it for a week, it has very good suction (even on the lowest setting) plus 2 boost modes, pickup of fine dust, fur and large bits is great on carpets, the body is light and easy to carry around and it runs quieter than other vacuums due to the inverter motor. The filter is easy to access from the top of the main unit and comes with a spare. The wall mounted charge dock is convenient. The brush hasn't tangled with any hair yet. Overall this is a great choice in the stick vacuum world."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jan 11, 2023","REVIEWER_NAME":"Aaron68174","TITLE":"The best All In One","CONTENT":"Had it for a while now, it's the first vacuum I've bought since a Dyson ball about 6 years ago. The LG's features are complete, there's almost nothing more I could ask for. Extra battery, complete set of attachments. Honestly I don't use the automatic empty that much because I like operating the whole thing manually, but it's great for spot cleaning. The tower matches my decor easily and gives me a nice organized central location for all things vacuum."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jan 9, 2023","REVIEWER_NAME":"Ramani","TITLE":"Review of LG Cscuum","CONTENT":"It met all my expectations, especially the wet mop!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jan 8, 2023","REVIEWER_NAME":"PaulP69","TITLE":"Awesome! Easy to use","CONTENT":"So easy to just grab, use, put back and then the tower sucks it spotless clean again. Removable battery with a spare is also an awesome feature!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jan 6, 2023","REVIEWER_NAME":"JojoR","TITLE":"Amazing, that's all I can think of to say!","CONTENT":"It was so easy to get everything set up and OMG I've never used such a strong vacuum in a stick before.  The thing I have never seen anyone mention is the corner cleaning.  One of the first things I noticed was that when I went along side a wall, that dirt was picked up very well.  I didn't have to go back in to the corners and brush things out it was just all gone!\r\n\r\nIt's a little heavier than I expected, but still very light and manageable even with my arthritis.\r\n\r\nHaving asthma, one of the hardest things about vacuuming for me was that I had to wait for my husband to get home to take it outside and empty the old ones before I could continue.  I don't have to worry about that anymore with this new vacuum because it does it all itself  How simple can it get!\r\n\r\nThe speed of the machine on it's normal setting is more than adequate for my needs.  Works great on my ceramic tile floors, wood floors and carpeting.  I'm good to go! Merry Christmas to me for sure!\r\n\r\nI can't thank you enough for creating this vacuum.  It was definitely on the high priced end, but I think that purchase will be more than worth it!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":3,"POST_DATE":"Jan 3, 2023","REVIEWER_NAME":"TechieMomGA","TITLE":"Keep getting errors … troubleshooting each use.","CONTENT":"I literally used the vacuum 6 times before getting errors wachbuse. So I purchased another one to use on another level of the home hoping the issue was isolated to the one machine (which I’m in the middle of troubleshooting … cleaning all parts). Fingers crossed resolves the issues. If not LG, I’d like a refund :("},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 30, 2022","REVIEWER_NAME":"Gus16","TITLE":"Best Vacuum ever.","CONTENT":"I am a nurse and with a busy schedule. There in not a lot of time for cleaning Cordzero makes my life easy and no need to worry about emptying the vacuum every time. Best investment on 2022"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 29, 2022","REVIEWER_NAME":"Paul","TITLE":"I’ve had it for only 4 weeks and it’s been...","CONTENT":"I’ve had it for only 4 weeks and it’s been working good so far. The suction is decent enough to pick up dog hair and perfect for everyday use. It’s so nice that I don’t need to empty the canister when I’m done vacuuming. It does it for me when I dock the unit. I have not replaced the bag yet after 4 weeks of use so that’s another positive. It’s a tad pricey but overall I’m pleased with this purchase."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 27, 2022","REVIEWER_NAME":"Woospike","TITLE":"Great product","CONTENT":"I bought this a month ago and am using couple of times a day. It’s a great product with easy handling. It works great with the right size and weight."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 26, 2022","REVIEWER_NAME":"Mike FranklinTN","TITLE":"Best Stick Vacuum","CONTENT":"I bought this one month ago.  The sticker price seemed a bit high, but in the end it is well worth the price.  The convenience, storage unit, auto-emptying are all nice features.  The mop attachment works very well and it is a simple clean up after."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Dec 25, 2022","REVIEWER_NAME":"Ceyda","TITLE":"All sweep!","CONTENT":"[This review was collected as part of a promotion.] Cordless feature with 2 charges and automated trash box are my favorites with this model. It is lightweight and easy to maneuver. Mop attachment is a plus."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Dec 25, 2022","REVIEWER_NAME":"Steven Fulghum","TITLE":"Solution Mindfulness","CONTENT":"[This review was collected as part of a promotion.] I have had my eye on this product since shortly after its introduction.  Previously, I had a separate electric mop and stick vac with accessories that were 'all over the place' and difficult to keep them organized.  I am very happy with my purchase.  I find the quality of the product very good.  I like the style factor, the power of the vacuum, and the ability to organize accessories centrally.  And yes, the extra battery is fantastic because my previous Dyson pooped out on, it seemed, 5 minutes before I could finish a chore.  Plus, the self-emptying feature is very convenient.  My feedback concerns the mop capability.  It simply needs to be stronger.  I would characterize this by what I see in the results and that this functionality simply takes too many passes to achieve expected results (vs. w\/my separate electric mop as a comparison).  I will take on experimenting for more effectiveness, but regardless, I am happy to have this high quality, multi-functional device in my home."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"","REVIEWER_NAME":"Amola 7177","TITLE":null,"CONTENT":"[This review was collected as part of a promotion.] Dirt suction power is fine.\r\nI am very happy with it."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":1,"POST_DATE":"Dec 18, 2022","REVIEWER_NAME":"Crews84","TITLE":"Great Idea, Poor Execution","CONTENT":"Continually got clogged with pet hair and eventually burned the motor out.  Lasted less than 6 months."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 16, 2022","REVIEWER_NAME":"TX Postmaster","TITLE":"Love the Auto Empty","CONTENT":"Have used this vacuum for 3 weeks now.  It is easy and convenient to use.  The Cleaning\/Charging\/Storage tower is very functional and does not look bad sitting in the corner of the living room.  Our reasons for selecting this Stick Vacuum were:  1st was the Auto Empty; 2nd it came with 2 rechargable batteries; 3rd the power mop attachement."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 13, 2022","REVIEWER_NAME":"Michael H in Houston","TITLE":"This thing is amazing!","CONTENT":"[This review was collected as part of a promotion.] I was skeptical when I ordered the LG CordZero but the more I read about it the more I wanted to try it out.  With two old dogs (17 and 23… yup. That’s right) I vacuum every single day of my life. The biggest issue was having to pull the vacuum out, constantly unplug it to move it it around the house and then wrap the cord up and put it back up. It was a royal pain. \r\n\r\nI honestly thought I wouldn’t have the power with a cordless option, but it’s not the case in the slightest.  The best part is I have the tower in the living room and it looks great. Modern, out of the way yet very convenient to use and  It recharges quickly. I’ve yet to have to use the second battery. The attachments are out of the way and seem to work great as well. \r\n\r\nIt is absolutely worth the investment. \r\n\r\nSo far, I’m very impressed and look forward to using it."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Dec 12, 2022","REVIEWER_NAME":"Anonymous","TITLE":"Love the convenience of this vacuum!","CONTENT":"[This review was collected as part of a promotion.] Very convenient and easy to use. But it has a hard time picking up solids on the wood floors. I’m not sure why it wouldn’t suck up my sons dried up top ramen noodles. Other than that I love the versatility and ease of use."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 11, 2022","REVIEWER_NAME":"Anonymous","TITLE":"Prestige design and unmatched build quality !","CONTENT":"Very well built and design ! Made house cleaning simple and easy"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 11, 2022","REVIEWER_NAME":"Kansasman","TITLE":"The Real Deal","CONTENT":"I’ve had this only a week but so far it’s more powerful than the Dyson we had before and the the extra battery makes this machine. Light weight and easy to use without that annoying trigger! Worth the price and the hype. The only cons would be that it needs a soft brush and a place to put sanitizer for the mop feature. LG you’re almost there!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 6, 2022","REVIEWER_NAME":"Angelita Fregoso","TITLE":"Best Cordless Vacuum Ever!","CONTENT":"[This review was collected as part of a promotion.] I was debating if I should get this vacuum or not because as you all know this vacuum isn’t cheap, but upon reading all the reviews I was convinced. When I first put it together I must say I didn’t think it was all that good as advertised. The suction isn’t as strong as I thought but considering it’s battery operated that’s to be expected. I just got a chance to use it now I’m obsessed!! Although suction isn’t that strong it’s enough. I’m happy with this purchase and I do recommend it."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 22, 2022","REVIEWER_NAME":"JHCCAZ","TITLE":"CordZero vacs are QUIET! Love Auto Empty bagging!","CONTENT":"We now have three households in our extended family with the Cord Zero all in one Auto Empty model.. I need encouragement to keep up with dusting, and so I appreciate the convenience ofa cordless vac but I hate dealing with emptying any Bagless vac which are the most popular these days. The feature of having bagged and filtered emptying into the recharging station is a great solution. By the way, the station also works for emptying other Cord Zero models, even the non-compressor units seem to work fine. So we keep our previous model upstairs and use the downstairs Auto Empty station for it as well.\r\n\r\nThe other big point, which LG doesn't seem to promote very much, is that these vacuums are notably quieter than most competitors. We previously had one of the competing models from the well known deluxe brand, and I hated it because it was so loud and very shrill sounding. The LG is deceptively powerful considering how much quieter it runs. Of course you can boost the speed, but even on Turbo the LG is not as hurtful to the ears. Note also that dogs and cats are more sensitive to loud high pitched noises than we are, they don't run away from this vacuum like they did with the other one. This quietness benefit is hard to prove from just reading the websites. Check out the Project Farm video comparison on YouTube where he reports the measured sound level of all tested units. LG is at or near the quietest and is still competitive in other performance categories."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 20, 2022","REVIEWER_NAME":"Nancy5246","TITLE":"Everyone needs this vacuum","CONTENT":"I have had this vacuum for about 2 weeks and I’m obsessed. I had always had a stick vacuum for about 10 years, and hated having to empty it constantly when I vacuumed. I have 2 dogs, and the hair filled up my Dyson in 10 minutes. Then I would have to pull the dog hair out with my fingers. Ugh!! It was horrible. Now that I have the LG auto emptying vacuum, it is an absolute pleasure vacuuming my house. I never have to pull dog hair out to empty the vacuum again. What a game changer. Worth every penny!!!! I cannot recommend this vacuum enough."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"","REVIEWER_NAME":"clos727","TITLE":null,"CONTENT":"Great product and easy to use. Love all the attachments and having two batteries is a plus."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 12, 2022","REVIEWER_NAME":"Fight for this","TITLE":"This is the best Vacuum ever!","CONTENT":"I’m real excited about my new vacuum cleaner! Its fantastic, works very well, it’s beautiful and so easy to use! I highly recommend the LG CordZero Vacuum!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 6, 2022","REVIEWER_NAME":"Anonymous","TITLE":"Very High Quality Unit","CONTENT":"I have been using this vacuum for 6 months now and I am very impressed. All the materials are high quality. It does a good job of emptying the dirt out when you stow it. Super easy to use, I would highly recommend this to anyone. The mop attachment actually works good on my hard wood floors. I was worried that it wouldn't perform well since there wasn't any suction and it was just a mop. But it actually picks up a lot of dirt and does a good job scrubbing. 10\/10 would recommend. \r\n\r\nI have a 2000 square foot house that is 50\/50 carpet and hardwood and I never go through a single battery. So the second battery isn't really needed. The first battery seems to last for almost an hour. And with how dusty Texas is I usually fill up the container in 20-30 minutes and hang up the vacuum. So I have never had to swap out the battery."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Nov 1, 2022","REVIEWER_NAME":"Mactastic","TITLE":"AUTOMATIC EMPTYING INTO A BAG!","CONTENT":"I received this vacuum about a week ago, and I’ve been using it for every day cleaning of my entire house. It has powerful suction, and it’s much quieter than cordless vacuums I’ve purchased previously. My favorite feature is the self-empty base, which automatically empties the contents of the dust bin into a sealed bag. No longer do I have to touch the contents of the dust bin, which will always be a plus. I simply remove, and throw away the bag, then insert a new bag into the self-empty base. Let’s not forget that the vacuum comes with not one, but two batteries that I can swap when one runs out of juice. The self-empty base will charge the additional battery while I’m vacuuming. With this vacuum I can track my cleaning history over Wi-Fi with the LG ThinQ app. Unfortunately, it isn’t without flaws, and requires improvement. Prepare to cut and\/or remove long hair from the brushroll. It’s best to have a nozzle that prevents long hair from wrapping around the brushroll. Also there’s no illumination on the nozzle so I can’t see what I’m vacuuming."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 31, 2022","REVIEWER_NAME":"Kymbro","TITLE":"Love the ease of vacuuming now!","CONTENT":"I've had this just over a week and absolutely love it! Is it the strongest, most powerful vacuum that'll efficiently do shag carpets? No. But it's great for picking up cat litter off the vinyl floor and I've been more apt to do that with this cordless beauty. I threw away my little broom I used to use. I'm not sure what I like best the cordless feature or the self-cleaning feature. \r\nAlso I like the mop! Is it the best? Again, no. But it's sufficient for small areas at a time. It's a bit slow but on my vinyl flooring it works fairly well. \r\nI was nervous to spend the amount I spent on this but I'm glad I did thus far!!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 29, 2022","REVIEWER_NAME":"Cinci NY","TITLE":"Worth the price","CONTENT":"Love this machine.  Best cordless…powerful but not too loud.  Love the auto depending into a bag so the canister stays looking clean. I was pleasantly surprised that it comes with a floor mop!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 7, 2022","REVIEWER_NAME":"JHule7","TITLE":"Second to none.","CONTENT":"Absolutely fantastic. This vacuum does everything you need and more. I love how it automatically cleans itself when you plug it back into the port. Yes it may be more than other competitors, but it is in a league in its own and is an investment!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 6, 2022","REVIEWER_NAME":"Vyatk","TITLE":"The best!","CONTENT":"The best cordless vacuum I’ve ever had. Not only that it works on different surfaces, I also love the mop feature. It’s literally a multi-tools combined."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 3, 2022","REVIEWER_NAME":"BennyJR","TITLE":"Great vacuum great accessories and power","CONTENT":"[This review was collected as part of a promotion.] I have used this brand new vacuum for quite some weeks already.\r\nIt has great suction power and the accessories are a 5 star along with the battery life and the extra one that comes included with it so you won’t stop once you started working with it.\r\nWith the different attachments or tools makes this vacuum a versatile and very light weight vacuum that our money can buy now a days..\r\nNow the self emptying feature it makes me love it even more …\r\nLove it.. definitely would recommend it to family and friends"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 25, 2022","REVIEWER_NAME":"Anonymous","TITLE":"Great features.  Cabinet organizes all accessories","CONTENT":"Bought one and loved it so much bought another one!!  Love the mopping feature and extra battery but mostly love how it empties after each use!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 17, 2022","REVIEWER_NAME":"AceofSpades1996","TITLE":"10\/10 Would Recommend!","CONTENT":"[This review was collected as part of a promotion.] I have owned this vacuum for about 6 months now, and I am impressed with the suction it provides and the battery life. The difference attachments make this vacuum one of the most versatile, if not THE most versatile (and lightweight!) vacuums money can buy currently! The LG mobile app this device pairs with could use some refining. The self emptying feature is me and my 2 year old sons favorite feature by far. The only thing I wish was different about this product is that it came with more dust bins for the self emptying feature within the housing for the vacuum. Overall I am happy with this purchase! Thanks LG!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Sep 7, 2022","REVIEWER_NAME":"hjh2c","TITLE":"Love this LG CordZero Vaccuum!","CONTENT":"[This review was collected as part of a promotion.] I have recently gotten the LG Electronics CordZero Vaccuum and love so many things about this handy device! The vacuum came with so many assorted attachments including one for pet hair and a mopping attachment. It also came with an extra battery which I love!  The run time on one battery is a little over an hour if I keep it in auto mode and don't switch to Turbo. I love having that extra battery on hand and charged up the Tower when I need it. One unique feature about the CordZero is that it's handy base recharges it, stores the extra parts, battery and attachments as well as has an Auto Empty feature for cleaning out the debris from the vacuum dust bin! I love that is takes one more clean up step out of my normal routine! The tower is makes keeping all of the extra things that can be used with the vacuum so nice and tidy and in one spot for easy access. The vacuum is lightweight and the main attachment is easy to get around and under furniture. I like that the main attachment head is a bit smaller than some of the others I've seen as it can really get into tight spaces and under chairs. I love that when I turn it on, I don't have to keep holding down on a button to keep the suction going as I've had to do on vacuums I've had in the past. It does seamlessly from my hardwood to my tile to my carpet rugs and has a great Turbo mode that can be turned on for those places I worry have extra hard to reach dirt. The CordZero even has ap app that you can connect to that will show you run times. extra info on the troubleshooting and battery life. I think one of the super exciting things about the CordZero is that it has a mop attachment. Although this feature didn't live up to my expectations, I'll thrilled of the idea of a vacuum\/mop combo!  The mop attachment has a place to put in water and it has little round pads that velcro on to the vacuum and spin around once you start it up. You can control the amount of water that comes out (it has a low to high setting) but the problem  I had was that I didn't think it really \"mopped\" my floor. There was moisture but it can't be used with soap or cleaner of any kind and I just don't feel like my floor are properly \"mopped \" with just a slight layer of water. I used the microfiber mop heads for about 15 minutes on my tile while I was trying out the mopping feature and once done, the mop heads were already frazzled and looked to be coming undone. I love the IDEA of the mop combo, but in my ideal world, it would have been able to be used with a cleaner to really get it good and clean and I would have more function in the amount of water that comes out ( I couldn't tell much difference in the low or high adjustments on the mop attachment). Also, the suction is turned off when you use the mop attachment and I would love to see a function added to be able to use the mop with water and cleaner and then have it sucked back up or go back over the water with a drying function. Again, I love the idea, but feel like the mop attachment could have some improvement to make it a 5 star product. I do like that the mop attachment has a little blue light that shines to help show you where the water is on the floor. Overall, I am thrilled with the uniqueness and creativity that this LG CordZero Vacuum brings to my home. The tower with it's multitude of functions is a real game changer in my book!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 7, 2022","REVIEWER_NAME":"Anonymous","TITLE":"All the bells and whistles!","CONTENT":"[This review was collected as part of a promotion.] This vacuum has all the bells and whistles!  The wi-fi I'm not quite sure of yet, but it has every head you will need to clean your home, it even has a mop head!!  This vacuum is super light weight, but still manages to get all the dirt up.  I am completely taken with this product and will recommend it to everyone."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 7, 2022","REVIEWER_NAME":"Gjohnson12","TITLE":"Great vacuum","CONTENT":"[This review was collected as part of a promotion.] This LG Zero Cord Vacuum is amazing! It is a cordless vacuum which makes it very easy to clean because u can pick it up and go anywhere with it. There are two batteries that come with it so you can change it out when one is done for uninterrupted cleaning. There is all in one tower. The tower serves as a battery charging station that charges two batteries. You can clean and charge them at the same time with 120 minutes.it also  conveniently and discretely stores tools and accessories. Inside the tower there is also an auto empty that empties the dirt cup when the vacuum is docked.there are three vacuum bags that come with it for emptying debris. it has Kompressor technology that compacts the dirt inside the dust bin. It has one touch press button that turns it on\/off or you can select turbo power mode. The vacuum has a telescopic wand so you can adjust it to reach those high places. This vacuum is also a mop! It comes with mop heads and a power mop nozzle . You can mop hardwood floor with this and you can easily vacuum them too. It cleans carpets with ease and picks up pet hair very well too with the pet nozzle. It has Wi-Fi ThinQ which helps so you can run your vacuum for maintenance and diagnostics for upkeep ! Overall this vacuum is fantastic to have!!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 6, 2022","REVIEWER_NAME":"Jay323","TITLE":"Fantastic features","CONTENT":"[This review was collected as part of a promotion.] This vacuum is by far better than fantastic. The feature that this has are amazing. Let me start with the sucking power of this vacuum. When this is on normal it is strong and great for loose crumbs, pet hair , dirt, etc. click it up to turbo and it get down deep in the carpet for dirt a normal vacuum can’t get. Next let’s go to the battery life. 2 batteries are more than enough to clean an entire house (my house is 2800sq\/ft) and I have battery to spare. Let’s move on to the accessories you get all the tools you need to clean furniture under heat registers to tight spaces behind fridges and under tables. The wet mop head is efficient in cleaning your hard floors to a great shine and clean the mop head is very easy. Now let’s go to the base, it hides all the tools neatly and it looks modern and no one would know what is in there. The base also sucks out the dirt from the unit into a bag in the base for a hands free cleaning of the dirt out of the unit. Finally the wi fi option is great. Get the app and it tell you how much the vacuum is used, when the batteries are fully charged, the last day you vacuumed, how long you vacuumed, etc. This is a very durable product and is well worth the purchase. I don’t know how I made it with out one of these. NO POWER CORDS is great as well. All wireless."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Sep 5, 2022","REVIEWER_NAME":"Lawrence McClurkin","TITLE":"Big investment but great if you can afford it.","CONTENT":"Comparable to the high end dyson but the self cleaning feature is actually pretty clutch."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 4, 2022","REVIEWER_NAME":"Annabelle S","TITLE":"Quiet and effective","CONTENT":"[This review was collected as part of a promotion.] I’m really happy with this vacuum. It took me probably only half and hour to set it up with the stand by myself. Cleaning-wise, it works very effectively in one pass and runs way quieter than any of my previous vacuums. Love that it charges and empties itself!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 4, 2022","REVIEWER_NAME":"JuneDee","TITLE":"The greatest QUIETEST vacuum ever!","CONTENT":"[This review was collected as part of a promotion.] To begin I must say the set up instructions were superb. The set up instructions are so easy that from opening the box to starting the device should take 30 minutes or less.this vacuum has an amazing suction level. It is so quiet it is amazingly hard to believe how powerful the suction is. I must say if your still at this point having second thoughts , please don’t hesitate to purchase the biggest bonus is NO CORD. There is so many great features with this vacuum it’s hard to name them all . Including self cleaning vacuum multiple cleaning tools. This is a must purchase !!!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 3, 2022","REVIEWER_NAME":"littlerabbit","TITLE":"The perfect vacuum!","CONTENT":"[This review was collected as part of a promotion.] I've been very impressed with this vacuum so far. Took a bit to set it all up but once you're done you have an all-in-one tower\/charge station that contains everything you need. All the attachments are stored inside the tower - no clutter at all! The actual vacuum is sleek and lightweight, and the lack of a cord offers so much freedom. It transitions easily between carpet and hardwood floors, and suction is strong even without going into the highest setting. It comes with an extra battery that sits in the tower until you need it, but I haven't had to use it yet! The main perk of this vacuum is the auto-emptying feature; once you've finished vacuuming you just place it back into the charge station and it'll empty itself into a bag installed inside. You can set this to automatic or manual with just a press of a button (and if you're wondering if you can still manually empty it, you can!) There's also an app you can use, and while it's not required to use the vacuum it's very useful to have as it greatly helps with maintenance. I'd recommend it even if you're not a big fan of constant apps like I am. Overall I'd say it's exceeded my expectations. It's plenty strong and the convenience of going cordless is just too good. You'll definitely love cleaning with this vacuum!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 2, 2022","REVIEWER_NAME":"Ash80","TITLE":"LG CordZero ThinQ Vaccum","CONTENT":"[This review was collected as part of a promotion.] LG Cordzero cordless stick vacuum is made for cleaning your home with smart features. It's packed with accessories and features like the Kompressor system that compacts the dirt,dust and debris during cleaning.Auto Empty feature is phenomenal, simply place your vacuum into the storage\/Charging base and press start\/stop button and the LG Cord zero will empty itself into a dust bag,\r\n .I love the ThinQ app that works with the Vaccum and sends you notifications when to clean filters,battery indicators also if there's clogs,lodged debris in system.The LG Cord zero  has a mop as well that is amazing,just use plain water, with Velcro  washable mop pads,The cleaning nozzles are great ,a pet hair nozzle,angle nozzle for corners,mattress nozzle,LG has made an amazing ,innovative smart way to clean your home with smart technology at its finest, a must have for every home and the best clean is the LG CordZero thinQ."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 1, 2022","REVIEWER_NAME":"Olivia Moon","TITLE":"Extraordinary vacuum!","CONTENT":"[This review was collected as part of a promotion.] The LG CordZero has immediately become my favorite vacuum! Set up was so simple for the tower, the vacuum itself, and the Wi-Fi\/ThiQ app. First thing I did was get the batteries charging. Being able to charge the extra battery to have ready at all times is convenience at its finest! Next up was putting all the accessories in their place inside the tower. How wonderful to have a place for everything, right where you need it. I enjoy vacuuming so much more when it’s cordless. Cleaning can be a pain, having to drag a cord behind you, needing to switch plugs when you move onto a farther room! I am ecstatic to be cord free! I am able to go directly from the hardwood floors, to the tiled floors, and right to the carpet with ease. There’s no change in suction, no switch needing to be switched. It’s completely effortless. The battery life is superb. Two-story home, multiple bathrooms and bedrooms, a loft, kitchen, dining room, office, and a laundry room… all vacuumed with battery still remaining, 1\/3rd to be exact. Let me tell you, you never knew you needed your vacuum to empty itself until you have this LG CordZero Vacuum!! I never would have thought that would be my favorite feature. It’s incredible! The pictures I have attached are from the first use, after vacuuming with my current vacuum the day before! This not only shows that the suction power of the Smart Inverter Motor can get what your current vacuum is leaving behind, but also how well the auto empty feature works! Just when you think this vacuum can’t get any better…  Power Mop attachment! Amazing! This one vacuum has been able to replace three cleaning tools (stick vacuum, dust buster, and mop) for me and I am so thankful!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 1, 2022","REVIEWER_NAME":"Chris863","TITLE":"One word! AMAZING!","CONTENT":"[This review was collected as part of a promotion.] I have to tell you that have never been so excited to use this LG CordZero vacuum! It is so quiet and powerful! Has several attachments for cleaning hard to reach places and has floor mopping attachment unlike anything I’ve ever used! So light and easy to use. I love how the stand holds everything neatly and charges the unit when placed in the cradle. The spare charger is great if you need to change out the battery in a hurry. The most exciting thing happens when you are done! This this cleans itself automatically! Thus LG vacuum is amazing and I definitely recommend it! Thanks LG for being so innovative! I’m impressed"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 1, 2022","REVIEWER_NAME":"Ann59","TITLE":"Makes cleaning enjoyable","CONTENT":"[This review was collected as part of a promotion.] I was so excited to get the LG Cordzero with ThinQ.  With it being cordless,  I can vacuum my whole house without searching for nearby outlets and having to plug and replace my vacuum. It has two batteries to ensure that I can finish the job.  The charging tower serves as the charging base as well as storing all the extra attachments. You can quickly switch the attachments. It has a crevasse tool to reach between couch cushions, a dusting brush, a pet tool to easily pick up pet hair from my furniture, there's even a mop attachment to do hard surfaces.  The ThinQ app will help with maintenance of the vacuum. It has a gratis that will automatically empty the debris that you've vacuumed after each time you use the vacuum. With the kompressor, you can compact debris you've picked up giving additional space to finish vacuuming.  The wand is adjustable in length. There are three modes of vacuum power."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 1, 2022","REVIEWER_NAME":"Steph887766","TITLE":"Awesome vac with all of the bells and whistles!","CONTENT":"[This review was collected as part of a promotion.] Is there anything this vacuum can’t do?! It’s awesome! It is high quality and well made. The construction of this compares to other stick vacs is top notch. The tube is metal where most others are plastic. The mop function is amazing and quick when there is a spill, and I love all of the stick vac accessories that come with it. The auto empty function saves us a ton of dust in the house now that we don’t need to empty our vacuum manually! I love it, and I don’t know how I lived without it before!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Sep 1, 2022","REVIEWER_NAME":"Goldfish12","TITLE":"Amazing","CONTENT":"[This review was collected as part of a promotion.] I am very impressed by this vacuum. It has amazing suction and the noise level is very low. There are so many attachments which I love. It's very sleek and slender so it easily fits into any space. My only complaint are the doors. There is not latch so they can easily swivel open."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Sep 1, 2022","REVIEWER_NAME":"CJM2","TITLE":"Great When it Works","CONTENT":"[This review was collected as part of a promotion.] So many appliances now are highly advanced and innovative. They come with mobile apps and lengthy instructions. This vacuum is something new for sure. I am usually not a huge fan of mobile apps for everything but knowing when the vacuum is fully charged or has an issue by checking my phone can be handy sometimes.\r\n\r\n As for the vacuum itself; it works well. I, personally, had no issues with suction. Honestly, I tried all the settings and I can't imagine why anyone would need to use the Turbo function. I can't see how anyone would use that for regular day to day vacuuming. It's REALLY high intensity. The normal, basic setting is just fine for most floors, rugs and carpets. I think the suction is exceptionally good actually. It's amazing how you think something is clean and then see how much dust and hair gets picked up. \r\n\r\nThe pet attachment is handy for small areas that just need a quick clean up. The mop feature is interesting, I probably won't use that one as often. It does work just fine but I just don't like the extra clean-up of the device afterwards. What I really like this for is stairs. It's so much easier to maneuver than a regular vacuum and I can get the corners and angles of the stairs much easier and faster. \r\n\r\nThe automatic empty feature is pretty cool but I find that it only completely emptied the dust container about half the time. Even after compressing it and making sure it's not too full. Sometimes there will still be a bit of debris left that has to be manually emptied. However, that was not a big problem for me. I like the compact base station where you can store and charge the vacuum and all the attachments in one place. It's easy to assemble, charge and to set up.\r\n\r\n My main issue is the sensitivity of the vacuum. It reminds me of old smartphones that had the capability to take very high-resolution photos but the phone itself would practically shut down when you used the feature. A lot of high-tech devices have this issue. They design the appliance to be very advanced but, counterintuitively - also too sensitive, so that it requires constant maintenance just to keep it functional on the most basic level. This is a big issue for me because when I clean; I want to get it done quickly and efficiently. I don't like stopping every few minutes and having to check the vacuum because it's saying it's \"blocked\". Only to have to completely disassemble the entire thing to figure out what tiny bit of fluff is supposedly \"blocking\" it. The usual culprit of the \"blockage\" is a tiny dust bunny or some barely visible piece of fluff that I have to spend 5 minutes and a tweezer to find. More times that I like; I had to give up and just use my regular vacuum cleaner to finish my chores. A big deal breaker for me because I don't like having to walk on eggshells around my appliances because I'm not sure if they'll work or allow me to get my tasks done that day without issue. That is my only but most major con.\r\n\r\nOther than that; this vacuum is very good for basic tasks and day to day cleaning. Great for stairs and small areas. Good suction and helpful features and attachments."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Aug 31, 2022","REVIEWER_NAME":"E1g1n","TITLE":"LOVE","CONTENT":"[This review was collected as part of a promotion.] I have never loved a Vacuum more than this one! I have had several upright Vacuums and robot Vacuums over the years, but always tend to quit. I love this is an all in one center with auto dumping features.  The suction on the Vacuum is amazing and the mop is better than my traditional mop. I love all the different types of attachments it comes with and it's cordless. I can use it on my ceiling fans, wall, furniture and floors."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Aug 31, 2022","REVIEWER_NAME":"Angelocampo70","TITLE":"Amazing","CONTENT":"[This review was collected as part of a promotion.] Received this wonderful product! I have never used something as awesome as this! My wife loves it more! She enjoys cleaning the boarders and the edges! She threw out the out vacuum and made a special place for this!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Aug 31, 2022","REVIEWER_NAME":"arb71","TITLE":"Super light and easy to use","CONTENT":"[This review was collected as part of a promotion.] I like this vacuum a lot because it is super lightweight and easy to push.  It doesn't hurt my back to vacuum using this vacuum. The fact that it empties itself into the tower is a great feature and so simple. The only downside to this vacuum is that it doesn't really seem to get down into the carpet.  It seems to just glide over the top rather than really do deep cleaning.  Other than that, I love it."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Aug 31, 2022","REVIEWER_NAME":"Matt Sc","TITLE":"Quiet, Great Vacuum, Eh Mop, Proprietary Bags","CONTENT":"[This review was collected as part of a promotion.] Wow, I was not expecting so many parts and pieces to arrive in such a large box. After getting over my initial shock, everything was pretty straightforward to put together and all of the components and attachments either store in or hang on the base, so it doesn't take up as much room as I feared.\r\n\r\nThe vacuum itself is deceptively quiet and works great. We have a similar style stick vacuum from another well known brand and it must be 2-3 times louder than this vacuum, but seems to perform the same. We have a dog that'll dash out the doggy door when our old vacuum turns on. With this vacuum, she's still not pleased, but she'll hang out one room over instead of making a beeline for the backyard.\r\n\r\nThe vacuum itself comes with a number of attachments-- a general floor head (with spinning brushes) a narrower pet hair head (with spinning rubber flaps) and a mop (no suction, just rotating pads). It also has the usual brush, crevice tool, etc. One cool thing worth mentioning is that the aluminum tube (between the vacuum and head) is extendable, so this is actually comfortable to use while standing-- you don't have to hunch over.\r\n\r\nFor performance, I find that you can get about 15 minutes out of one battery on the highest speed, but closer to 45 minutes with the lowest speed-- which has more than enough power for hardwood floors, etc. This set also comes with a spare battery (that sits under the lid of the storage tower and is always charged), so you can actually get some cleaning done in between charges.\r\n\r\nThe general flooring head with the bristles works well-- it picks up pretty much everything. The rubber flap head for pet hair is okay. It does good for hair that is fresh on the surface (so couches, car seats, etc)-- but it does not work miracles. If you have a rug with hair that's worked in over the past 2 years and is really embedded in there, not much will get it out, including this head.\r\n\r\nThe mop head is a bit of a disappointment. It has a small reservoir, you can't use hot water, and you can only use plain water (no cleaning solutions). Because of this, it's really limited in its usefulness for me.\r\n\r\nFinally, the base\/storage station is pretty slick. It always keeps the vacuum charged (expected), does a good job at holding all the accessories (good design), but the real feature is the auto emptying of the hand vac. If it's in AUTO mode, as soon as you dock the vacuum, it pops it open, sucks out all the dust and gets it ready to go again. I turned it off of AUTO because it is loud. It's basically as loud as a corded vacuum cleaner when it goes off. Overall, I love it. My only disappointment is that it empties the vacuum into a proprietary LG vacuum bag that they are currently pretty proud of. Hopefully a third party comes out with a more economical choice in the future.\r\n\r\nSo, final verdict? I love it, it's sleek, works well, is quiet, and is well thought out. Don't buy it for the mop feature (more of a gimmick in my eyes) and do be aware of the ongoing costs of the proprietary bags (though you can manually empty the vac into your own trash can, but that kind of negates the best feature of this system-- the auto emptying), but if you can get past those, then I think you'll really like what LG did with this product."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":3,"POST_DATE":"Aug 26, 2022","REVIEWER_NAME":"Gina","TITLE":"Just ok","CONTENT":"Wasn’t thrilled with it for over a grand. And I really hate to return to a bag system. Surely they could have just made a cup or bin."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":1,"POST_DATE":"Aug 10, 2022","REVIEWER_NAME":"Momzof4","TITLE":"Don't do it!","CONTENT":"This is by far the worst vacuum I have ever owned.  It truly does not work, like at all. It barely picks up anything. The turbo mode takes you immediately in a low battery. Seriously the worst choice I have ever made, returning ASAP."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jul 29, 2022","REVIEWER_NAME":"Jeryljam","TITLE":"Loving it","CONTENT":"[This review was collected as part of a promotion.] Great product!  Lightweight.  Works great.  Easy to switch attachments.  Also like the mop attachment for my wood and tile floors.  Auto emptying is great feature - so easy.  And charging tower ensures both batteries always ready to go."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":2,"POST_DATE":"","REVIEWER_NAME":"FEDOR","TITLE":null,"CONTENT":null},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jul 26, 2022","REVIEWER_NAME":"Adele2301","TITLE":"Best vacuum","CONTENT":"[This review was collected as part of a promotion.] I’ve had this vacuum for a few months and just love it. My house is so fresh and clean cause there is no dust from the vacuum."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Jul 6, 2022","REVIEWER_NAME":"Nicolini","TITLE":"Works good so far","CONTENT":"[This review was collected as part of a promotion.] Purchased 20 days ago, arrived with broken mop nozzle, was replaced , nicely built works good way to expensive"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"","REVIEWER_NAME":"AUDREY","TITLE":null,"CONTENT":null},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"","REVIEWER_NAME":"AMANDA","TITLE":null,"CONTENT":null},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jun 28, 2022","REVIEWER_NAME":"LG CordZero","TITLE":"Looks can Deceiving! In a good way.","CONTENT":"[This review was collected as part of a promotion.] This Vacuum has exceeded all expectaions we had from a cordless stick vacuum. Very powerful and lightweight. The self cleaning feature in the tower is such a bonus. We use the floor polisher\/mop attachment more than we thought we would. Highly recommend this Vacuum to anybody!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Jun 28, 2022","REVIEWER_NAME":"TJSZX2","TITLE":"LG CordZero is my new best friend","CONTENT":"[This review was collected as part of a promotion.] The first cordzero I admit did have a slight malfunction so back to went to the store for exchange since it would not empty the vacuum.  The replacement one I received works as advertised and I absolutely love it.  This vacuum stands it ground against the forever shedding of two German Shepherds....has more suction than one would expect a stick vacuum to have, and ove the sleek look of the tower."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":3,"POST_DATE":"Jun 28, 2022","REVIEWER_NAME":"JTP123","TITLE":"Small disappointment","CONTENT":"[This review was collected as part of a promotion.] We use this at least 2 times a day, if not more. Dogs and kids are messy. The only thing I don't like about it is the vacuum attachments don't have the ability to turn off the rotation over hard floors and there are not lights on the vacuum attachments.  The mop has a light, come on LG."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":1,"POST_DATE":"Jun 19, 2022","REVIEWER_NAME":"tt226","TITLE":"Brand New Unit Came Broken","CONTENT":"I was very happy and excited to open this new product. The concept of this vacuum was different, which had me switch over to LG (coming from owning several Dyson vacuums and other Dyson products). After watching many reviews on this vacuum and seeing other people un-boxing videos. I had high hopes for this product. However, the extension pipe arrived with a dent mark. Another worst thing, the main unit was not sucking up any of the dirt! The dirt bin was completely brand new, even after vacuuming the whole basement. The vacuum powers on (for certain attachments) and off, WI-FI worked and connected to device. The power mode did not work at all. The speed of the vacuum was the same, even when trying to switch it to turbo mode. It's like it has only one mode. The lowest mode possible. With the standard attachment, the brush would spin like normal and managed to pick up some debris from the carpet. As soon as I lift the vacuum up, all the debris fell back on the carpet. When I place my hand near the attachment, I can feel the air flow coming out. I tried all the little attachments, couldn't even get the power to turn on. Both batteries were fully charged. \r\n\r\nI reached out to LG support and the representative suggested to ship the main unit back to them for repairs and diagnostic but it'll take 3-5 days to get the shipping box. Plus an additional 7 days for them to do the repairs. The extension pipe is in for replacement. Honestly, for a product that is this pricey. I'm very disappointed. A vacuum that doesn't even vacuum.... I had zero issue with my other vacuums. You buy a product brand new hoping everything will work properly on the first try. \r\n\r\nJust a very bad experience. Will update the review once the unit is repaired. But so far, I'm not sure how I feel about this product. I can't tell you to skip the hassle and go with another brand. At this moment, that's what I'm leaning towards. But I will give it another try once it's fixed."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":1,"POST_DATE":"Jun 1, 2022","REVIEWER_NAME":"Jennifer","TITLE":"I have to return it since it will never work...","CONTENT":"I have to return it since it will never work nor does anyone want to tell me how to return it"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"May 14, 2022","REVIEWER_NAME":"Homeowner","TITLE":"Best I've ever owned!","CONTENT":"Easily the best vacuum I've ever purchased. My carpet feels more plush than ever before, it runs for quite a long time, and the storage, charging and auto emptying is nothing short of a blessing. If you get this and are concerned about your floors getting scratched, make sure you take the time to read the manual- it is your responsibility as the owner of the product to use it as recommended. LG got everything a vacuum needs to do and went the extra mile with this thing."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":1,"POST_DATE":"May 12, 2022","REVIEWER_NAME":"ROGER","TITLE":"Getting ready to take ir back...","CONTENT":"Getting ready to take ir back"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":2,"POST_DATE":"Apr 29, 2022","REVIEWER_NAME":"Syd34","TITLE":"Underwhelming","CONTENT":"[This review was collected as part of a promotion.] I bought this vacuum as an investment, I thought it would be a high quality, enjoyable and easy to use. However the suction is extremely weak and to even get to enough power it has to be at the most powerful turbo mode which only lasts for seven minutes on a four hour battery charge. If this is how weak it is now I hate to think how useless it will become once it starts to lose power. The features on this otherwise are both useful and well made so it having so little power is extremely disappointing. Plus the one tiny wheel is not large enough making using this vacuum extremely hard to move on carpet most vacuums pull away from you and are able to pull in dirt surrounding the outside of the tool but this is unable to do either. Finally the feature that allows you to adjust the height is very nice in thought but due to the fact that it often unlocks during use making it shrink and grow with movement makes it irritating and overall more difficult to use. I was extremely disappointed by all of this as I’m usually a fan of lg products as my fridge, washer, dryer, stove, etc. are all lg products. I hope lg is able to improve on this product and bring it to match the higher standard of its other products."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Apr 8, 2022","REVIEWER_NAME":"Nichol T","TITLE":"Definitely Worth The Money","CONTENT":"[This review was collected as part of a promotion.] I love this vacuum it is worth every penny. I love the different features and specs"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":1,"POST_DATE":"Apr 8, 2022","REVIEWER_NAME":"Nickiename","TITLE":"Scratched My Floors","CONTENT":"[This review was collected as part of a promotion.] I loved the vacuum until it scratched my brand new hardwood floors! It works as expected on carpet, but is not made for hardwood. It took all of a minute to notice that it did not pick up fine dirt\/particles well; the longest I could even try due to my floors being scratched. BTW, nothing was trapped in the vacuum. This was fresh out of the box."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":3,"POST_DATE":"Feb 21, 2022","REVIEWER_NAME":"MStone","TITLE":"Its okay","CONTENT":"I do like the auto dump, however I feel like the suction could be alot better. Also it would be nice to have a light at the front. I have only used this in laminate and tile floors. For the price it coukd becalot better."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Feb 7, 2022","REVIEWER_NAME":"Maytrs","TITLE":"Quiet but cleans well!","CONTENT":"[This review was collected as part of a promotion.] This LG CordZero vacuum is a lot quieter than my other cordless vacuum but it cleans well. \r\nThe charging stand is my favorite! I usually lose the attachment pieces but this holds almost all of the attachments including the extra battery.\r\nI also love the auto empty feature and the mop feature. I would definitely recommend this to everyone!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":1,"POST_DATE":"Jan 12, 2022","REVIEWER_NAME":"Angelaemvi","TITLE":"Can’t pick up cereal to save its life","CONTENT":"I returned my dyson for this vacuum and it sucks on hard floor. It won’t pick up pieces of cereal it breaks them and pushes them around it’s so frustrating for how expensive it is"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":4,"POST_DATE":"Jan 5, 2022","REVIEWER_NAME":"RL65","TITLE":"Great Vac!","CONTENT":"[This review was collected as part of a promotion.] I like this vacuum alot. I like that the extra tools are hidden in a compartment, I like that you can empty the dust bin on your own or that it empties itself. The only thing I am not a fan of is the mop it leaves streaks on my tiled floor."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 29, 2021","REVIEWER_NAME":"DMD210","TITLE":"Love it!","CONTENT":"[This review was collected as part of a promotion.] I got the LG Cordzero vacuum about a month ago and I love this vacuum. It cleans so well and the fact that all three attachments tuck neatly into the charging base and are easy to get to makes using it quick and simple."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Dec 14, 2021","REVIEWER_NAME":"Emelee","TITLE":"Best vacuum cleaner I’ve ever had!","CONTENT":"[This review was collected as part of a promotion.] I can honestly say this is by far the best vacuum cleaner I’ve ever owned! It is light and very maneuverable. I love how the dock is a charging station, backup battery charger, and self cleaning dock all in one! I really love the suction power that never declines. This is due to the self cleaning dock clearing out all the dirt and dust each time place the vacuum on it. It also comes with a self watering mop attachment which is super useful for my hardwood floors! I very highly recommend this!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 28, 2021","REVIEWER_NAME":"JUSTMOM","TITLE":"Love love Love this vacuum!!!","CONTENT":"[This review was collected as part of a promotion.] About this LG CordZero Vacuum, I wish I have the ability to write down all the wonderful things about it.  This is an outstanding vacuum no matter the user-friendly design, all the attached accessories, and the performance, all and all, this is the king!\r\nI mostly use a vacuum to clean up our house about twice a week, we have 50% carpet and 50% vinyl floor, with this vacuum I can use it on both surfaces.  \r\nThe auto empty charging station is so well-made and very user-friendly, you can store the extra tools inside the station. \r\nThe auto empty design is really impressive!  So convenient and really work perfectly, so after a few weeks, the vacuum still looks brand new!\r\nThe filter inside the vacuum is so easy to change or clean, there are so many extra nozzles and tools, all well-designed and high quality.\r\nThe most and the best is the owner's manual is so clear and easy to understand. \r\nOverall I highly recommend this vacuum!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 26, 2021","REVIEWER_NAME":"Bbjniles","TITLE":"Beauty, power and function!","CONTENT":"[This review was collected as part of a promotion.] Wow, wow, wow…this LG CordZero Vacuum is incredible.  It looks so sleek and modern, it holds and hides most of the attachments, it empties itself, and is an absolute workhorse.   This is a great piece of equipment…LG has really outdone itself!\r\n\r\nI will say that removing it from the box can be a little intimidating.  There are a lot of wrapped pieces, and a ton of instructions.  That said, it is intuitively built, so assembling everything is a breeze.  The tower opens to reveal cubbies for the three attachments and the brush for occasional cleanings.  There too is the bag that holds the refuse when the vacuum is emptied.  This is behind a door, so when the tower is opened, everything is put away and tidy.\r\n\r\nIt also comes with a power mop head, though this is very large and will have to be stored separately.  Still, we already had a power mop, so we are actually saving room since we can get rid of it, and only have to store the mop head for the CordZero.\r\n\r\nAnd while we are here, I will say that the mop head works very well, spinning vigorously, and sparing your back, as traditional mopping requires much more elbow grease.  The pads attach using Velcro, and are easily removed and cleaned.  There is a water reservoir and two setting to choose from in terms of wetness.  This head is (as too are all the attachments) easily installed and removed.\r\n\r\nThe stick portion of the device requires depressing a sliding button to choose your desired length, so it works well for those of most heights.  \r\n\r\nThere is a power bottom on the handle, which is great for those with weak hands or aching joints.  Many stick vacuums require you to hold a trigger down, which can be difficult and annoying, but not so with the CordZero.  There are three settings, the lowest being fine for most all the time.  The battery lasts around an hour, though that varies whether we are using it on our wood floors or carpets.  The top setting eats the battery quickly, so we rarely use it.  Still, it comes with two batteries, one of which charges in a cubby at the top of the tower while not in use, and you are meant to trade them with each run (as they will, according to the instructions, lose their ability to hold a charge over time).  We haven’t experienced reduced battery yet, so I can’t comment on that.  The batteries seat nicely in both the vacuum and tower.\r\n\r\nThis thing really is a marvel to look at, especially considering it’s a vacuum.  The tower is spare and modern, casting minimalistic lines, and not drawing undue attention, but fitting in well.  This is great for us, as we don’t have a closet with an outlet inside, so the CordZero has to stay out in a room.  I imagine this is true for many people, so that fact that it looks so clean is a huge plus…it doesn’t clutter up your space, but instead blends into it.\r\n\r\nThe vacuum does feel a bit heavier that precious stick vacuums we’ve owned, but none are as feature robust, and most are corded so you can’t free range your home with them.  It is quite loud when you place it in the tower and it empties itself, but it only lasts a few seconds, so it doesn’t cause much distraction.  Too, this certainly has more power than I expected, so kudos to LG for that.\r\n\r\nWe really are over the moon with the CordZero…it can do everything, so were able to declutter by removing  an old corded stick vacuum, and a corded power mop.  And we can do it in high style.  \r\n\r\nFrom the aesthetics to the functionality, the LG CordZero is top notch, and I really couldn’t recommend it highly enough!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 26, 2021","REVIEWER_NAME":"LalaT","TITLE":"Game changer!","CONTENT":"[This review was collected as part of a promotion.] I LOVE this product. It is lightweight and the head swivels really sleekly to get those corners and hard to reach areas. I really love that is cordless so no more fighting the cord being in the way and switching outlets to get the job done. Works well on hardwoods, tile, carpet and area rugs. I love how the attachments store in the stand so they won't get lost. Also the self emptying is so cool. My husband is looking forward to using it to vacuum out his truck since it can also be a hand vac. I cannot recommend this enough! It makes vacuuming fun and my kids actually WANT to vacuum. That alone makes it worth every penny!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 24, 2021","REVIEWER_NAME":"huntersgrandma","TITLE":"Love This !!!!","CONTENT":"[This review was collected as part of a promotion.] I got the LG CordZero Vacuum a few weeks ago, and I love it!! Where to begin, first super easy to assemble, and then just put it in a corner for easy access!! This vacuum is awesome, it is not only a great vacuum, but a mop too!! It cleans super well, and even dog hair, which is great when you have dogs like me!! You can even download an app to connect to your wi-fi!! It can empty into your charging station so your are not emptying after every use!! It is so well made and its just all around an awesome vacuum\/mop!! I would very highly recommend this vacuum to everyone!!!!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 23, 2021","REVIEWER_NAME":"Thatdad86","TITLE":"Amazing!","CONTENT":"[This review was collected as part of a promotion.] This is a great vac. The battery life is good, it lasts a long time, especially if you make sure to charge after each use. This vacuum picks up like a champ. We have 2 cats and a dog so we have a lot of pet hair. This picks it all up!! Crumbs, gone, cat hair, gone! Easy to use and super easy to set up. It is extremely easy to pick up and handle."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 16, 2021","REVIEWER_NAME":"RaleighNCGuy","TITLE":"Awesome Vacuum!","CONTENT":"[This review was collected as part of a promotion.] We love this vacuum so much! The vacuum is really powerful, especially using the turbo mode. It is so convenient to have a vacuum like this around the house. It’s really great to not have a cord to drag around! One of the coolest features is the self-emptying tower. The self-emptying feature is very powerful and works really well. The tower also has very handy built-in storage for the vacuum attachments, and the overall footprint is pretty compact. Overall, this is a really nice vacuum system and we are very happy with it!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 15, 2021","REVIEWER_NAME":"Adolin","TITLE":"Good vacuum","CONTENT":"[This review was collected as part of a promotion.] This thing is so cool it boxed up perfectly the vacuum itself has some really cool features like it has a little thing on if it scraped off the filter it’s really cool the functionality is awesome it comes with two batteries this is a really really cool vacuum even though the the extension on it is really easy to use. It works great. This thing has all the attachments you would need including a wet mop attachment! The tower is super cool! It sucks the dirt out of the vacuum for you. Very cool vacuum!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 15, 2021","REVIEWER_NAME":"MegBrit","TITLE":"Absolutely Amazing!","CONTENT":"[This review was collected as part of a promotion.] Let me start off by saying this is the absolute best vacuum by far. My husband was skeptical that a cordless vacuum could clean our carpets better than a traditional plug-in vacuum. He vacuumed our bedroom with the other vacuum (a very expensive and highly rated). When he was done, I took the LG CordZero and went back over the carpet. Wow! I got quite a bit in the canister. My husband was impressed. I also love that the stand has self-cleaning. The dust that you typically have to deal with is non-existent when emptying out. I am so thrilled with this vacuum. I have not yet had the opportunity to use the mop feature on our hardwoods. I cannot believe I’m about to say this, but I cannot wait to mop my floors! Do yourself a favor, and go ahead and purchase the LG CordZero."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 14, 2021","REVIEWER_NAME":"MeganM33","TITLE":"Best vacuum I've ever used","CONTENT":"[This review was collected as part of a promotion.] WOW! This LG cordzero blows away any Dyson I've ever had (I've had 3 models) and the Shark that I most recently started using. It is quieter, the auto empty feature is downright amazing, and it has a perfect amount of power to pick up the hair from my 2 dogs plus all the grass clippings that inevitably get tracked into the house. \r\n\r\nI haven't even tried the mopping option yet, but I am sure it's amazing as well. \r\n\r\nI will say that the amount of instructions that come with this device are plentiful - so many different instruction booklets and cards made it a little confusing but I guess when it comes to directions for a new device, more is better than less. \r\n\r\nI love how this vacuum is small enough to fit under furniture, like beds, to clean. Also it's sleek appearance has me not even minding that it sits out in the living room! It does have to be plugged in so it can charge - which makes storing it in a closet difficult. But it's so nice looking that it doesn't even matter. \r\n\r\nI recommend this over and over - I am geeky excited to have this new vacuum in my arsenal!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 13, 2021","REVIEWER_NAME":"Anonymous19","TITLE":"Best Vacuum Ever","CONTENT":"[This review was collected as part of a promotion.] Lightweight, heavy suction, fairly quiet, powerful and has so many great accessories. Love the cordless aspect and batteries run long enough for entire house to be cleaned. Auto empty into bag is awesome! Storage \"tower\" is pretty compact and doesn't take up too much space (huge bonus). Great for vacuuming stairs and, as dog owners, all the furniture that attracts pet hair."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 11, 2021","REVIEWER_NAME":"Tonape","TITLE":"Highly efficient cordless stick Vaccum cleaner wit","CONTENT":"[This review was collected as part of a promotion.] Aesthetically it has all features to get good hold of this stick vacuum cleaner. Its very light in weight and very easy to maneuver. This stick has inbuilt feature to adjust the height which is pretty cool. Its much quieter than traditional heavy duty vacuum cleaner but little nosier than its competitor. \r\nVacuum cleaner is highly efficient in cleaning the floor. Highly effective on every thickness of the carpet. If small carpets roll in the vacuum cleaner, just stop the vacuums cleaner and it easily comes off.  It works just fine. Smooth in operation. Mop feature is also highly effective. Battery life is pretty good. It comes with spare battery so no issue of running out of juice. Really impressed with its aesthetic.\r\nTower is designed just to the perfection. Its compact in nature. Looks good. It can accommodate attachments which was impressive. (which helps a lot in our case) Emptying the vacuum cleaner in auto mode is absolutely easy, just hang it up and it will job for you. No mess at all. This tower can charge both batteries at a time including one installed in the cleaner. \r\nThis is impressive setup and clean way to use the vacuum. Highly recommended."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Nov 10, 2021","REVIEWER_NAME":"JennUNC123","TITLE":"Modern day cleaning system!","CONTENT":"[This review was collected as part of a promotion.] The LG Cord Zero All-in-One Tower is not your standard stick vacuum, it's an entire cleaning system tucked away inside a modern piece of art!  Even before I used the cordless stick vacuum to clean my home, I instantly felt that my house improved a few notches by having this fancy and extra sleek all-in-one tower displayed proudly in my laundry room.  Not only does it it look beautiful, but it holds a myriad of tools and accessories that can be used to clean just about everything in your home. The suction of the vacuum is fantastic and the battery charge lasts for a very long time. An extra battery is included, but I haven't found it necessary since the charge hold is more than sufficient. The Vacuum itself is very light and it's easy to maneuver. \r\n\r\nAll of the six tools included in the tower have come in handy, but I especially love the  mop nozzle option.  It is super easy to use and only requires water while getting your tile and hardwoods spotless!  \r\nAnother favorite feature of the LG CordZero is that the vacuum is cordless so you don't have to worry about getting tangled up in cords. Not having to constantly rearrange cords makes along with not having to find outlets to replug as you move through your home makes cleaning a lot less daunting. Lastly, the vacuum automatically clears the dust and dirt into a collection bag within the tower so you can don't have to \"clean up after you clean up\"! I would definitely recommend the LG CordZero All-in-One tower to everyone, but especially for those who love to use all the latest and greatest technology and innovative products."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 11, 2021","REVIEWER_NAME":"Dgg123","TITLE":"Best vacuum ever","CONTENT":"[This review was collected as part of a promotion.] This is the coolest vacuum ever it does everything including my tile floors. And on top of all that it empty’s it’s self. And it’s so easy to you and with not having a cord you get into places that don’t usually get touched all the time. Picks up dog hair great. I just love this vacuum you can just take off charger and do quick pick up."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 6, 2021","REVIEWER_NAME":"wocket","TITLE":"Love this vacuum!","CONTENT":"[This review was collected as part of a promotion.] This is my first wireless vacuum after a life of corded uprights. I can't believe how great it is - if I see dirt or a ball of dust - just grab the vacuum off the rechargeable stand, vacuum it up and return it. No more unwinding the cord, vacuuming, then winding it back up. Also - if you are used to a corded vacuum like me - this one is so light! Vacuuming stairs has never been easier (or safer in my opinion). It has a spare battery if you have a lot of cleaning to do. I have not needed it yet. The suction on it is great and it is very easy to steer around corners. A great vacuum indeed!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 5, 2021","REVIEWER_NAME":"suckitup87","TITLE":"The most amazing thing!","CONTENT":"[This review was collected as part of a promotion.] I have to say I was blown away by this product. I didn't expect to love it so much, but LG went above and beyond to make this easy for the buyer, and effortless for cleaning. This is likely the best purchase I've made this year."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 4, 2021","REVIEWER_NAME":"Skincaid87","TITLE":"Perfection","CONTENT":"[This review was collected as part of a promotion.] I am obsessed with this vacuum the two recharging batteries, the self cleaning on its on makes it worth it alone. Easy to use and great on all surfaces.\r\nLight weight, doesn’t require lots of space, this is the all time best vacuum I have ever had!!"},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 3, 2021","REVIEWER_NAME":"Bennysmom","TITLE":"Great Stick Vaccum","CONTENT":"[This review was collected as part of a promotion.] I’m so in love with my LG Cord stiick vacuum with charging station.It has such a powerful suction.It’s light weight but so durable .It empty’s it’s self in a container .It has a charging station which is awesome.This is the best Vacuum i’ve ever had .It’s amazing ."},{"RETAILER":"THE HOME DEPOT","PRODUCT":"LG CordZero","RATING":5,"POST_DATE":"Oct 2, 2021","REVIEWER_NAME":"NC_Ken","TITLE":"Wow","CONTENT":"[This review was collected as part of a promotion.] It’s quiet and powerful and in a household with 2 kids and a dog, we need both. The adjustable length is huge, too, because it’s comfortable for everyone in the house to use. And can we talk about the fact that the vacuum empties itself when it’s on the charging dock? Wow. Game changer."}]